Repository: Provenance-Emu/Provenance
Catalog: Provenance/Resources/*.lproj/Strings.strings
Languages: nl

source: Loading
nl: Bezig met Laden

source: Core Options
nl: Core Opties

source: Auto Save
nl: Automatisch Opslaan

source: Timed Auto Saves
nl: Getimed Automatisch Saven

source: Auto Load Saves
nl: Automatisch Laden Opgeslagen Saves

source: Ask to Load Saves
nl: Vragen om Saves te Laden

source: Opacity
nl: Transparantie

source: Video Options
nl: Video Opties

source: Button Colors
nl: Knop Kleuren

source: All-Right Shoulders
nl: All-Rechts Schouder

source: Enable 8BitDo M30 Mapping
nl: 8BitDo M30 Mapping Inschakelen

source: Appearance
nl: Uiterlijk

source: Git Revision
nl: Git Revisie

source: Unknown
nl: Onbekend

source: Licenses
nl: Licenties

source: Systems
nl: Systemen

source: Volume HUD
nl: Geluidsvolume HUD

source: Native Scale
nl: Native Grote

source: Integer Scaling
nl: Geheel Getal Schaleren

source: Image Smoothing
nl: Afbeelding Gladmaken

source: FPS Counter
nl: FPS Teller

source: Missing Buttons Always On-Screen
nl: Vermiste Knoppen altijd In-Beeld

source: Use Metal
nl: Gebruik Metal

source: Disable Auto Lock
nl: Uitzetten Automatisch Vergrendelen

source: Launch Web Server
nl: Start de Web Server

source: Game Library
nl: Spel Bibliotheek

source: Refresh Game Library
nl: Ververs Spel Bibliotheek

source: Empty Image Cache
nl: Leeg Afbeelding Cache

source: Manage Conflicts
nl: Conflicten Beheren

source: Advanced Features
nl: Advanced Opties

source: Version
nl: Versie

source: Build Information
nl: Build Informatie

source: 3rd Party & Legal
nl: 3de Partij en Legaal

source: No
nl: Nee

source: Empty Image Cache?
nl: Leeg Afbeelding Cache?

source: Yes
nl: Ja

source: Acknowledgements
nl: Dankbetuigingen

source: Database Error
nl: Database Fout
